package kr.pe.gracefulife.observer.study;

/**
 * Created by Gracefulife on 2016-03-02.
 */
public class Scenario {
    /**
     * -------------------------------------------------------------
     * 사업주 moon 씨는 매번 고용인 Kim 씨를 비롯한 여러 고용인이
     * 지각 및 농땡이를 매우 자주 피우는 것 같다 라는 느낌을 받는다.
     * 하지만 명확한 기록이 관리되지 않아 근태관리를 하기가 쉽지 않다라고 느낀다.
     *
     * Kim씨의 행태가 점점 심각해지자 이 어떻게 해결할 수 있을까 라는 고민을 하게되고,
     * 몇 일 동안을 해당 문제로 고민을 하다가 구글 광고에서
     * 센서 기반의 출입 기록기를 발견하게 되는데...
     * -------------------------------------------------------------
     *
     * 정리.
     *
     * 고용인과 사업주가 있고,
     * 사업주는 사무실 입구의 모션센서로
     * 고용인의 출근 및 퇴근, 외출 시간 등의 정보를 체크한다.
     */
}
